USE SQLAcademyVPU_011;
GO

INSERT INTO schedule
             (group_name, speciality_name, teacher_name, day_of_week)
			 VALUES
			      (N'VBU_011', N'Программирование', N'Абрамов', N'понедельник'), 
				  (N'VPU_011', N'Программирование', N'Абрамов', N'вторник'),
				  (N'BD_011', N'Программирование', N'Абрамов', N'среда'),
				  (N'VPU_011', N'Системное администрирование', N'Баранов', N'вторник'),
				  (N'NA_011', N'Системное администрирование', N'Баранов', N'вторник'),
				  (N'DU_011', N'Системное администрирование', N'Баранов', N'вторник'),
				  (N'BV_012', N'Системное администрирование', N'Баранов', N'суббота'),
				  (N'NA_012', N'Системное администрирование', N'Баранов', N'пятница'),
				  (N'BV_011', N'Компьютерная графика', N'Тихонов', N'среда'),
				  (N'NA_011', N'Компьютерная графика', N'Тихонов', N'воскресенье'),
				  (N'VPU_012', N'Компьютерная графика', N'Тихонов', N'понедельник'),
				  (N'BD_011', N'Разработка web-сайтов', N'Крюков', N'четверг'),
				  (N'PV_011', N'Разработка web-сайтов', N'Крюков', N'четверг');
				  
GO  

SELECT * FROM schedule;