USE SQLAcademyVPU_011;
GO

INSERT INTO students
             (last_name, first_name, middle_name, birth_date, study_group, speciality, rating, attendance)
			 VALUES
			      (N'Ремизов', N'Дмитрий', N'Викторович', '1993-06-18', 1, 2, 98, 99),
				  (N'Сорокина', N'Мария', N'Владимировна', '1994-08-24', 1, 2, 98, 98),
				  (N'Вагурин', N'Дмитрий', N'Владимирович', '1988-02-10', 1, 2, 97, 95),
				  (N'Володин', N'Алексей', N'Николаевич', '1986-03-11', 1, 2, 98, 99),
				  (N'Иванов', N'Иван', N'Иванович', '1980-03-11', 2, 2, 98, 99),
				  (N'Петров', N'Петр', N'Петрович', '1981-04-11', 3, 2, 98, 99),
				  (N'Андреев', N'Андрей', N'Андреевич', '1999-07-11', 2, 3, 85, 85),
				  (N'Маринина', N'Мария', N'Николаевна', '1976-03-11', 1, 2, 90, 90),
				  (N'Павлов', N'Павел', N'Павлович', '1987-08-10', 1, 1, 98, 99),
				  (N'Волошин', N'Сергей', N'Николаевич', '1980-03-10', 5, 4, 98, 99),
				  (N'Козлова', N'Алла', N'Петровна', '1983-08-01', 8, 3, 98, 99),
				  (N'Болодин', N'Алексей', N'Николаевич', '1996-12-11', 7, 3, 98, 99),
				  (N'Солодин', N'Борис', N'Романович', '1997-03-11', 10, 4, 95, 99),
				  (N'Володина', N'Елена', N'Андреевна', '1992-12-06', 4, 4, 94, 99),
				  (N'Родин', N'Алексей', N'Георгиевич', '1990-09-12', 5, 1, 93, 87),
				  (N'Родина', N'Светлана', N'Алексеевна', '1990-09-12', 6, 2, 90, 93),
				  (N'Родин', N'Андрей', N'Георгиевич', '1991-09-12', 5, 1, 90, 88),
				  (N'Ролин', N'Виталий', N'Георгиевич', '1992-09-12', 9, 2, 91, 90),
				  (N'Рогин', N'Василий', N'Георгиевич', '1993-09-12', 10, 3, 92, 91),
				  (N'Рожин', N'Алексей', N'Георгиевич', '1994-08-10', 12, 4, 93, 92);
GO

SELECT * FROM students;