USE SQLAcademyVPU_011;
GO

INSERT INTO teachers
             (last_name, first_name, middle_name, birth_date, study_group, speciality)
			 VALUES
			      (N'Абрамов', N'Дмитрий', N'Викторович', '1970-06-18', 1, 1),
				  (N'Абрамов', N'Дмитрий', N'Викторович', '1970-06-18', 2, 1),
				  (N'Абрамов', N'Дмитрий', N'Викторович', '1970-06-18', 3, 1),
				  (N'Абрамов', N'Дмитрий', N'Викторович', '1970-06-18', 4, 2),
				  (N'Баранов', N'Андрей', N'Викторович', '1971-08-10', 2, 2),
				  (N'Баранов', N'Андрей', N'Викторович', '1971-08-10', 3, 2),
				  (N'Баранов', N'Андрей', N'Викторович', '1971-08-10', 4, 2),
				  (N'Баранов', N'Андрей', N'Викторович', '1971-08-10', 5, 2),
				  (N'Тихонов', N'Алексей', N'Петрович', '1972-03-18', 3, 3),
				  (N'Тихонов', N'Алексей', N'Петрович', '1972-03-18', 4, 3),
				  (N'Тихонов', N'Алексей', N'Петрович', '1972-03-18', 5, 3),
				  (N'Тихонов', N'Алексей', N'Петрович', '1972-03-18', 6, 3),
				  (N'Тихонов', N'Алексей', N'Петрович', '1972-03-18', 7, 3),
				  (N'Тихонов', N'Алексей', N'Петрович', '1972-03-18', 3, 1),
				  (N'Крюков', N'Дмитрий', N'Викторович', '1980-10-25', 4, 4),
				  (N'Крюков', N'Дмитрий', N'Викторович', '1980-10-25', 5, 4),
				  (N'Крюков', N'Дмитрий', N'Викторович', '1980-10-25', 8, 4),
				  (N'Крюков', N'Дмитрий', N'Викторович', '1980-10-25', 9, 4),
				  (N'Крюков', N'Дмитрий', N'Викторович', '1980-10-25', 10, 4),
				  (N'Крюков', N'Дмитрий', N'Викторович', '1980-10-25', 11, 4);
GO

SELECT * FROM teachers;